from dataclasses import dataclass

@dataclass
class Config:
    TOKEN: str = "7793901040:AAHw4jrYfYOKPRk0vTe7svIIwx4iJ97I6wg"

# تعریف رشته‌ها و درس‌ها
DEPARTMENTS = {
    "مهندسی کامپیوتر 💻": "computer",
    "مهندسی برق ⚡": "electrical",
    "مهندسی مکانیک 🔧": "mechanical",
    "مهندسی عمران 🏗": "civil",
    "مهندسی شیمی 🧪": "chemistry"
}

COURSES = {
    "computer": ["برنامه‌نویسی پیشرفته", "ساختمان داده", "پایگاه داده", "هوش مصنوعی", "شبکه‌های کامپیوتری"],
    "electrical": ["مدارهای الکتریکی", "الکترونیک ۱", "الکترونیک ۲", "سیستم‌های دیجیتال", "مخابرات"],
    "mechanical": ["استاتیک", "دینامیک", "مقاومت مصالح", "ترمودینامیک", "سیالات"],
    "civil": ["مقاومت مصالح", "تحلیل سازه", "مکانیک خاک", "بتن", "سازه‌های فولادی"],
    "chemistry": ["شیمی عمومی", "شیمی آلی", "انتقال حرارت", "ترمودینامیک", "کنترل فرآیند"]
} 